{"intents": [
    {"tag": "greetings", 
    "patterns": ["hi", "hey", "good day", "good evening", "hello there", "start", "what's up?", "howdy", "how are you doing?", "greetings", "good morning", "hi bot", "hello chatbot", "hi there", "how are you?", "how are you feeling?", "how is your day today?"],
        "responses": [ "Hello! How can I help?",
                       "Hi! Ask me something about climate change and I'll try to help.", "Hi there, what can I do for you?" ], 
    "sources": [""]},
    {
        "tag": "end_conversation",
        "patterns": [
            "bye",
            "bb",
            "bye bye",
            "it was nice chatting with you",
            "see you later",
            "thank you that's enough",
            "abort",
            "cao",
            "goodbye",
            "thank you, bye",
            "see you later",
            "see you later",
            "cya",
            "thanks for help",
            "break",
            "shut down",
            "turn off"
        ],
        "responses": [ "Thank you for approaching me! Hopefully chat to you later!", "Bye, stay healthy!" ],
        "sources": [ "" ]
    },
    {
        "tag": "definitions",
        "patterns": [ "definition of climate change", "definitions that are given to", "how is it defined?", "What is a climate change", "What is global warming?", "What's the climate change is about", "Climate change definition", "describe climate change", "explain climate change", "tell me about global warming and climate change", "what is climate change definition", "climate change meaning", "global warming meaning", "climate change and global warming definitions", "what is global climate change", "what is climate change definition", "what is climate change mean", "about climate change", "define global warming", "define climate change", "what is it", "what is greenhouse effect", "greenhouse gases", "green house effect", "green house gases", "greenhouse gases", "what is green house effect?", "what's is a greenhouse gas?", "what is green house gas?", "what are green house gases?" ],
        "responses": [ "Climate change is the long-term shift in average weather patterns across the world. Since the mid-1800s, humans have contributed to the release of carbon dioxide and other greenhouse gases into the air. This causes global temperatures to rise, resulting in long-term changes to the climate.", "Climate change includes both global warming driven by human emissions of greenhouse gases and the resulting large-scale shifts in weather patterns.", "Global warming usually refers to human-induced warming of the Earth system, whereas climate change can refer to natural as well as anthropogenic change. The two terms are often used interchangeably." ],
        "sources": [ "" ]
    },
    {
        "tag": "causes",
        "patterns": [ "what causes climate change", "what are the main drivers of climate change", "why climate is changing", "reasons why global warming", "what causes global warming", "why is it getting hotter", "why temperatures rise", "How are humans changing the climate?", "what is the greenhouse effect", "what are the sources of greenhouse gases", " what leads to global warming", "what leads to climate change", "what drives temperatures to rise", "why is it hapenning", "what causes it", "what drives it to heat up", "why is it rising?", "why is it happening?", "why is it still happening?", "Why is earth is not cooling down?" ],
        "responses": [ "Evidence has shown that the high levels of greenhouse gases in the atmosphere are the leading cause of increasing global temperatures. Scientists have been able to rule out natural events as causes of climate change, such as volcanic activity, changes in solar activity, or natural sources of CO2.  These may, however, have a small effect, on top of human contributions. In their most recent report, the International Panel on Climate Change (IPCC) states that human activity is 'extremely likely' to be the main cause of climate change.", "The evidence is clear: the main cause of climate change is burning fossil fuels such as oil, gas, and coal. When burnt, fossil fuels release carbon dioxide into the air, causing the planet to heat up.", "Some gases in the Earth's atmosphere trap heat and stop it escaping into space. We call these 'greenhouse gases'. These gases act as a warming blanket around the Earth, known as the 'greenhouse effect'.", "The greenhouse gases absorb some of this infrared radiation, instead of it passing straight out into space. The atmosphere then emits radiation in all directions, sending some of it back to the surface, causing the planet to heat up. This process is known as the 'greenhouse effect'.", "Humans cause climate change by releasing carbon dioxide and other greenhouse gases into the air. ", "Burning fossil fuels – Fossil fuels such as oil, gas, and coal contain carbon dioxide that has been 'locked away' in the ground for thousands of years. When we take these out of the land and burn them, we release the stored carbon dioxide into the air.", "Deforestation – Forests remove and store carbon dioxide from the atmosphere. Cutting them down means that carbon dioxide builds up quicker since there are no trees to absorb it. Not only that, trees release the carbon they stored when we burn them.", "Agriculture – Planting crops and rearing animals releases many different types of greenhouse gases into the air. For example, animals produce methane, which is 30 times more powerful than carbon dioxide as a greenhouse gas. The nitrous oxide used for fertilisers is ten times worse and is nearly 300 times more potent than carbon dioxide!", "Cement – Producing cement is another contributor to climate change, causing 2% of our entire carbon dioxide emissions." ],
        "sources": [ "source 1", "source 2" ]
    },
    {
        "tag": "facts",
        "patterns": [ "impacts of global warming and climate change and greenhouse effect", "impact of green house gases", "impact impacted impacting ", "impacts that we experience", "fact about climate change", "tell me random fact", "climate change evidences", "proof of global warming", "climate change is evidenced by", "i don't believe in climate change", "show me that it is real", "know that global warming is happening", "see climate change", "is the climate warming", "scientists know that recent climate change is largely caused by human activities", "evidences to prove global warming", "prove me", "signs of change", "signs of raising temperatures", "how do you know it's real", "where is the proof?", "what are your arguments", "says who", "proven by who", "how is it studied", "how is it proven", "why is it true", "how do you know it is true", "climate change effects", "impacts of climate change", "global warming effect", "climate change affect", "effects of climate change", "what effects climate change", "what are the effects of climate change", "effects of climate change to environment", "impact on environment", "evaluate the impact on Earth", "influence climate change", "influence global warming", "how climate change global warming influences impact affect", "why climate change is bad", "what is bad about climante change", "why global warming is bad", "concerns climate change global warming", "climate change affects", "how are we impacted", "affect on humans", "why is it bothering us?", "why to bother?", "so what?" ],

        "responses": [ "The current warming trend is of particular significance because most of it is extremely likely (greater than 95% probability) to be the result of human activity since the mid-20th century and proceeding at a rate that is unprecedented over decades to millennia.", "The planet's average surface temperature has risen about 2.12 degrees Fahrenheit (1.18 degrees Celsius) since the late 19th century, a change driven largely by increased carbon dioxide emissions into the atmosphere and other human activities.", "Air bubbles trapped in the ice show that levels of greenhouse gases in the atmosphere are closely linked to global temperatures. Rises in temperature match closely with an increase in the amount of greenhouse gases.", "The first line of evidence is our fundamental understanding of how certain gases trap heat, how the climate system responds to increases in these gases, and how other human and natural factors influence climate. The second line of evidence is from reconstructions of past climates using evidence such as tree rings, ice cores, and corals. The third line of evidence comes from using climate models to simulate the climate of the past century, separating the human and natural factors that influence climate. When the human factors are removed, these models show that natural variations are too small to explain the amount of warming.", "“Fingerprint” studies that are able to attribute observed climate changes to particular causes. The fact that the stratosphere (the layer above the troposphere) is cooling while the Earth’s surface and lower atmosphere is warming is a fingerprint that the warming is due to increases in heat-trapping gases." ],
        "sources": [ "evidence source 1 ", "evidence source 2" ]
    },
    {
        "tag": "recommendation",
        "patterns": [ "how to stop climate change", "how to stop global warming", "how to stop grennhouse effect", "what should we do", "fight with climate change", "recommendations to do", "tackling climate problem", "tackle climate change", "how reduce impacts", "make it better", "take action", "what action to make", "manage adapt to changes", "how to help", "i'm in what should i do", "directions and actions", "give me advice", "recommend actions", "is there an action plan", "lower impact of climate change", "how can i help to reduce these effects", "what can i do doily to stop the process", "what shouild i do in order to reduce the effect of global warming?", "anything i can do to help?", "how to combat that?", "how to make it stop?", "how to cool the temperature", "Little things that can help", "actions in order to minimise negative effect? " ],

        "responses": [ "Speak up! By voicing your concerns—via social media or, better yet, directly to your elected officials—you send a message that you care about the warming world.", "Power your home with renewable energy. Choose a utility company that generates at least half its power from wind or solar", "Heating and air-conditioning account for almost half of home energy use. You can make your space more energy efficient by sealing drafts and ensuring it’s adequately insulated.", "Invest in energy-efficient appliances. When shopping for refrigerators, washing machines, and other appliances, look for the Energy Star label. It will tell you which are the most efficient.", "Reduce water waste. Saving water reduces carbon pollution, too. That's because it takes a lot of energy to pump, heat, and treat your water. So take shorter showers, turn off the tap while brushing your teeth.", "Planting trees helps reduce the amount of carbon dioxide in the atmosphere as trees absorb it as part of the process of photosynthesis. Through planting trees carbon dioxide can be absorbed reducing greenhouse gasses in the atmosphere.", "The development of renewable energy solutions such as wind, solar and tidal energy reduces our reliance on fossil fuel burning power stations. This helps reduce carbon dioxide emissions being released into the atmosphere.", "There may be a greater need for developing water transfer schemes. This involves moving water from areas of surplus (more water than is used) to areas of water deficit (not enough water). This can be achieved by building water transfer pipelines." ],
        "sources": [ "recommendation source 1", "recommendation source 2" ]
    }, {"tag": "more", "patterns": ["what else?", "what more?", "more", "elaborate more", "say more", "anything else?", "more details", "repeat the answer", "say it again", "is there anything else?", "are there other things?", "explain deeper", "give me more information on that"]}]}